#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke-template/runs/run-Bi4M4AyCeDP89yG4

Waiting for the plan to start...

Terraform v0.13.1
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.data.external.env_override: Refreshing state...
module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.data.external.env_override: Refreshing state...
module.gke.data.google_project.host_project: Refreshing state...
module.gke.module.primary-cluster.data.google_container_engine_versions.region: Refreshing state...
module.gke.module.primary-cluster.data.google_compute_zones.available: Refreshing state...
module.gke.data.google_client_config.default: Refreshing state...
module.gke.data.google_project.service_project: Refreshing state...
module.gke.module.primary-cluster.data.google_client_config.default: Refreshing state...
module.gke.module.primary-cluster.data.google_container_engine_versions.zone: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke.data.google_container_cluster.current_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "current_cluster"  {
      + additional_zones                  = (known after apply)
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + database_encryption               = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + description                       = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + instance_group_urls               = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "asia-southeast2"
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = (known after apply)
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_version                      = (known after apply)
      + operation                         = (known after apply)
      + pod_security_policy_config        = (known after apply)
      + private_cluster_config            = (known after apply)
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # module.gke.google_project_iam_binding.compute-network-user will be created
  + resource "google_project_iam_binding" "compute-network-user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:434072338061@cloudservices.gserviceaccount.com",
          + "serviceAccount:service-434072338061@container-engine-robot.iam.gserviceaccount.com",
        ]
      + project = "test-gcp-project-01-274314"
      + role    = "roles/compute.networkUser"
    }

  # module.gke.random_id.run_id will be created
  + resource "random_id" "run_id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.gke.module.bootstrap.helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v0.16.1"
      + wait                       = true
    }

  # module.gke.module.bootstrap.helm_release.jaeger will be created
  + resource "helm_release" "jaeger" {
      + atomic                     = false
      + chart                      = "jaeger-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "telemetry"
      + namespace                  = "observability"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jaegertracing.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.15.1"
      + wait                       = true

      + set {
          + name  = "jaeger.create"
          + value = "true"
        }
      + set {
          + name  = "rbac.clusterRole"
          + value = "true"
        }
    }

  # module.gke.module.bootstrap.null_resource.configure_kubectl will be created
  + resource "null_resource" "configure_kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.download_kubectl will be created
  + resource "null_resource" "download_kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_operator will be created
  + resource "null_resource" "install_Elastic_operator" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_resources will be created
  + resource "null_resource" "install_Elastic_resources" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_IstioOperator_manifest will be created
  + resource "null_resource" "install_IstioOperator_manifest" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_cert-manager_crds will be created
  + resource "null_resource" "install_cert-manager_crds" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_istio_operator will be created
  + resource "null_resource" "install_istio_operator" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.set_kiali_credentials will be created
  + resource "null_resource" "set_kiali_credentials" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.setup_gcloud_cli will be created
  + resource "null_resource" "setup_gcloud_cli" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.primary-cluster.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + additional_zones            = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "asia-southeast2"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.16.13-gke.1"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = (known after apply)
      + network                     = "projects/test-gcp-project-01-274314/global/networks/private-vpc"
      + node_locations              = [
          + "asia-southeast2-a",
          + "asia-southeast2-b",
          + "asia-southeast2-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = "test-terraform-project-01"
      + region                      = (known after apply)
      + remove_default_node_pool    = false
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/test-gcp-project-01-274314/regions/asia-southeast2/subnetworks/private-vpc-subnet"
      + zone                        = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = true
            }

          + http_load_balancing {
              + disabled = true
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "private-vpc-pods"
          + node_ipv4_cidr_block          = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "private-vpc-services"
          + subnetwork_name               = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = 0
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = "default-pool"
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = (known after apply)
              + taint             = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + pod_security_policy_config {
          + enabled = (known after apply)
        }

      + release_channel {
          + channel = (known after apply)
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }
    }

  # module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = (known after apply)
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "asia-southeast2"
      + max_pods_per_node   = (known after apply)
      + name                = "pool-01"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + project             = "test-terraform-project-01"
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 200
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = (known after apply)
          + local_ssd_count   = 1
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/logging.logWriter"
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/monitoring.viewer"
    }

  # module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "test-terraform-project-01"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke.module.primary-cluster.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "test-terraform-project-01"
      + unique_id    = (known after apply)
    }

  # module.gke.module.primary-cluster.random_shuffle.available_zones will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = [
          + "asia-southeast2-a",
          + "asia-southeast2-b",
          + "asia-southeast2-c",
        ]
      + result       = (known after apply)
      + result_count = 3
    }

  # module.gke.module.primary-cluster.random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "3"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ca_certificate      = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURLekNDQWhPZ0F3SUJBZ0lSQU9MMGpoSkduQndDRW4xZE9XNGJFNUl3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01tTmpPV1kwTVRrdE5EZ3laaTAwWldabUxUZ3lZbVV0T1RneE9XTTROV1ZtWWpZegpNQjRYRFRJd01EZ3hPREEzTVRjd01sb1hEVEkxTURneE56QTRNVGN3TWxvd0x6RXRNQ3NHQTFVRUF4TWtNbU5qCk9XWTBNVGt0TkRneVppMDBaV1ptTFRneVltVXRPVGd4T1dNNE5XVm1Zall6TUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBaGdUZDIzVDJUUmlUUXhQNTZNcUJtYi85K0ZDajR6bEV0UUZmVS9tMwpXd0RsK2gzbjBLQzRDMjh4YzZVTlMwMFRoSXJUMkRReEpXa2l1WWNKLzJja1h3MjFDRU5BbkpNRElsQ3pabTB6CjcxYlg2K0dUd3kvbkYzWGo4Q3VDTWtza2VISU55ZTNiZGJlYUd0SUN4L0tZS0wzVDBOYnFxOHR1eE5PT21CbUwKU1llRHQwQzBpSzRsSE50eFZRR2w3THZlbjBSa3FZTzNzUlBuTTJUbllJTWVQQTg5NG1tOUlvUTVaeitybXRpVAp0MkVTdWZ1OEs4eHprL1gzZlc0a05NYnBYaGErWkdYaFVacGhQV0NWREp4c0ExTFJNM1NrclFrNHRSY1diQVA3Cnk4VFhZcW40cFJvQlRVbDhCZ1U3RFNjMTM4TlFCaERoeitWUEl4VTBwNGtUVndJREFRQUJvMEl3UURBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFRmdRVUNLYURsZDh6TklGZQpSdkttRmtlcW5MejdEd0V3RFFZSktvWklodmNOQVFFTEJRQURnZ0VCQURiK1o2anA4U2dvem5iVmJGL3YzNjRzCkNTYnRGVURWNmRJQVR4Zzd4QzA3SXpRbXRFZGxRUGNmMEp0T0tjQzFFbkxuemhZaVE4RFdXUzlVNUJETWE2QnEKL1pzbmpUcVk0TTc2MmhtdmhCcVBtZFBxRzhzSHl6eGhadnRUQ1hBdUxId3NQeEtxakt6UUZtZjZ2RlpBSm1ScQp0VG5sLzdDQ2JtRXZkTGdGTzJBd1pXT09WSW9ZanMrbUs1N3I4ai90UXpvc3Q0SDRpVzk2U29jNG9jazVBRklNCm5wdEoxY25HZWRJMlBnT25KWjljc0lVV0EzalMvVVZnSVBXckF0aGJYNEFmck9EMldET0pUVytGN3QvTGtkOW0KM0J5M0crS3QxM2N5ZGVJTllMQ0dURytRMUVkaU5qZTJ4NnF0Yy9MeW12N3liaGpsODFRajZUSkVlS2I4NEJRPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
  + client_token        = (sensitive value)
  + cluster_name        = (known after apply)
  ~ kubernetes_endpoint = (sensitive value)
  + service_account     = (known after apply)
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*